#ifndef _RESULT_STORY_H_
#define _RESULT_STORY_H_
//=============================================================================
//
// リザルトのストーリークラス [result_story.h]
// Author : Konishi Yuuto
//
//=============================================================================

//=========================================================================
// インクルード
//=========================================================================
#include "scene2d.h"

//=========================================================================
// 前方宣言
//=========================================================================

//=========================================================================
// クラス定義
//=========================================================================
class CResultStory : public CScene2D
{
public:
	CResultStory(PRIORITY = PRIORITY_UI);	// コンストラクタ
	~CResultStory();						// デストラクタ

	static CResultStory *Create(void);		// インスタンス生成
	HRESULT Init(void);						// 初期化処理
	void Update(void);						// 更新処理
	void Draw(void);						// 描画処理

	float GetPosY(void) { return GetPos().y; }
	bool GetEnd(void)	{ return m_bEnd; }
private:
	bool m_bEnd;		// 終了フラグ
};

#endif