#ifndef _SHADOW_POLYGON_H_
#define _SHADOW_POLYGON_H_
//=============================================================================
//
// 影用ポリゴンクラスヘッダー [shadow_polygon.h]
// Author : Konishi Yuuto
//
//=============================================================================

//=========================================================================
// インクルード
//=========================================================================
#include "scene2d.h"

//=========================================================================
// 前方宣言
//=========================================================================

//=========================================================================
// クラス定義
//=========================================================================
class CShadowPolygon : public CScene2D
{
public:
	CShadowPolygon(PRIORITY = PRIORITY_0);	// コンストラクタ
	~CShadowPolygon();						// デストラクタ

	static CShadowPolygon *Create(void);	// インスタンス生成
	HRESULT Init(void);						// 初期化処理
	void Draw(void);						// 描画処理

private:
};

#endif